11/data/attachments/af6d91f24504d1ab.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bc6b9d0a-cce8-45c1-9daa-78db7992207a</nif:username>
            <nif:friendToBeAdded>Christopher_represent_Friend_68160_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>